Конфигурация/Catalogs/ЮрФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЮрФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЮрФизЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ЮрФизЛица/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("ОтображатьТолькоКлиентов") Тогда
		ЭтаФорма.ОтображатьТолькоКлиентов = ЭтаФорма.Параметры.ОтображатьТолькоКлиентов;
	КонецЕсли;
	
	ЭтаФорма.Период = ТекущаяДата();
	
	Справочники.ЮрФизЛица.ПодготовитьДинамическийСписокФормыСпискаВыбора(ЭтаФорма);
	
	ЭтаФорма.ПолучитьРеквизиты();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ЭтаФорма.ОтображатьТолькоКлиентов Тогда
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо"));
		
		РезультатВыбора = СписокВыбора.ВыбратьЭлемент("Выберите клиента");
		Если РезультатВыбора <> Неопределено Тогда
			Если РезультатВыбора.Значение = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда
				ОткрытьФорму("Документ.АнкетаФизическогоЛица.ФормаОбъекта",, ЭтаФорма);
			Иначе
				ОткрытьФорму("Документ.АнкетаЮридическогоЛица.ФормаОбъекта",, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
	
		Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда
			ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица");
		Иначе
			ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица");
		КонецЕсли;
		
		РаботаСНормативноСправочнойИнформациейКлиент.ИмпортироватьНовыйОбъектИзМатрикс(ГруппаОбъектов, Элементы.Список);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортироватьОбъектыИзМатрикс(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда
		ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица");
	Иначе
		ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица");
	КонецЕсли;
	
	РаботаСНормативноСправочнойИнформациейКлиент.ИмпортироватьНовыйОбъектИзМатрикс(ГруппаОбъектов, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьВыделенныеОбъектыИзМатрикс(Команда)
	
	РаботаСВнешнимиСистемами.ОбновитьВыделенныеОбъектыИзМатрикс(Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Надо позиционироваться на клиенте
	Если ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.АнкетаФизическогоЛица")
		или ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.АнкетаЮридическогоЛица") Тогда
		Элементы.Список.ТекущаяСтрока = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйОбъект, "ЮрФизЛицо");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоКлиентов", ЭтаФорма.ОтображатьТолькоКлиентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиЗаявкуПайщика(Команда)
	
	ТекущийКлиент = Элементы.Список.ТекущаяСтрока;
	
	Если ТипЗнч(ТекущийКлиент) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		ОткрытьФорму("Документ.ЗаявкаПайщика.ФормаОбъекта", Новый Структура("Основание", Новый Структура("Пайщик", ТекущийКлиент)), ЭтотОбъект);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяОрганизация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	РаботаСФайловымХранилищемКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

#Область ВнутренниеПеречни

&НаКлиенте
Процедура ОтборВнутренниеПеречниПриИзменении_Подключаемый(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВнутренниеПеречни(Команда)
	
	Элементы.КомандаВнутренниеПеречни.Пометка = Не Элементы.КомандаВнутренниеПеречни.Пометка;
	
	Элементы.ГруппаВнутренниеПеречни.Видимость			= Элементы.КомандаВнутренниеПеречни.Пометка;
	Элементы.ГруппаВнутренниеПеречниОтборы.Видимость	= Элементы.КомандаВнутренниеПеречни.Пометка;
	
	УстановитьПараметрыОтборовВнутренниеПеречни(ЭтаФорма);
		
	ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыОтборовВнутренниеПеречни(Форма)
	
	Для Каждого Элемент Из Форма.Элементы.ГруппаВнутренниеПеречниОтборы.ПодчиненныеЭлементы Цикл
		Если Форма.Элементы.КомандаВнутренниеПеречни.Пометка Тогда
			Форма.Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, Форма[Элемент.Имя]);
		Иначе
			Форма.Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.КомандаВнутренниеПеречни.Пометка			= (Настройки.Получить("КомандаВнутренниеПеречниПометка") = Истина);
	
	Элементы.ГруппаВнутренниеПеречни.Видимость			= Элементы.КомандаВнутренниеПеречни.Пометка;
	Элементы.ГруппаВнутренниеПеречниОтборы.Видимость	= Элементы.КомандаВнутренниеПеречни.Пометка;
	
	Для Каждого Элемент Из Элементы.ГруппаВнутренниеПеречниОтборы.ПодчиненныеЭлементы Цикл
		ЭтаФорма[Элемент.Имя] = (Настройки.Получить(Элемент.Имя) = Истина);
	КонецЦикла;
	
	УстановитьПараметрыОтборовВнутренниеПеречни(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("КомандаВнутренниеПеречниПометка", Элементы.КомандаВнутренниеПеречни.Пометка);
	
	Для Каждого Элемент Из Элементы.ГруппаВнутренниеПеречниОтборы.ПодчиненныеЭлементы Цикл
		Настройки.Вставить(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
